code-review/NRB_3471_3546/База_Стало/Reports/АнкетаВыпускаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>АнкетаВыпускаЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенныеБумаги</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоСписку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоформирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/АнкетаВыпускаЦБ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&наСервере
Процедура УправлениеРеквизитамиФормыСервер()
	Элементы.РедактироватьСписокЦБ.Видимость	= Отчет.ОтчетПоСписку;
	Элементы.ЦеннаяБумага.Видимость				= Не Отчет.ОтчетПоСписку;
	Элементы.ЦенныеБумагиСписком.Пометка		= Отчет.ОтчетПоСписку;
	Элементы.ФормаСформироватьОтчет.Доступность	= (Отчет.ЦенныеБумаги.Количество()>0);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Отчет.ЦенныеБумаги.Количество()>0 Тогда
		ЦеннаяБумага	= Отчет.ЦенныеБумаги.Получить(0).Значение;
	КонецЕсли;	
	УправлениеРеквизитамиФормыСервер();
	Если Отчет.Автоформирование Тогда
		СформироватьОтчетСервер();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСписком(Команда)
	Отчет.ОтчетПоСписку	= Не Отчет.ОтчетПоСписку;
	Если Не Отчет.ОтчетПоСписку Тогда
		ЦеннаяБумага	= ПредопределенноеЗначение("Справочник.ЦенныеБумаги.ПустаяСсылка");
		Отчет.ЦенныеБумаги.Очистить();
	КонецЕсли;
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	Отчет.ЦенныеБумаги.Очистить();
	Отчет.ЦенныеБумаги.Добавить(ЦеннаяБумага);	
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокЦБ(Команда)
	ПараметрыПодбора	= Новый Структура("СписокЦБ", Отчет.ЦенныеБумаги.ВыгрузитьЗначения());
	Форма				= ПолучитьФорму("Отчет.АнкетаВыпускаЦБ.Форма.ФормаПодбораСпискаЦБ", ПараметрыПодбора, ЭтаФорма, ЭтаФорма.КлючУникальности);
	СписокВозврата		= Форма.ОткрытьМодально();
	
	Если СписокВозврата <> Неопределено Тогда
		 Отчет.ЦенныеБумаги.ЗагрузитьЗначения(СписокВозврата);
	КонецЕсли;	
	УправлениеРеквизитамиФормыСервер();
КонецПроцедуры

&наСервере
Процедура СформироватьОтчетСервер()
	ОтчетОбъект	= РеквизитФормыВЗначение("Отчет");
	Результат	= ОтчетОбъект.СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры
